var status = -1;

function start() {
	action(1, 0, 0);
}

var sel1;
var sel2;
var 必成卷轴 = Array(2040003, 2040007, 2040011, 2040015, 2040019, 2040103, 2040107, 2040111, 2040115, 2040119, 2040203, 2040207, 2040211, 2040215, 2040219, 2040303, 2040307, 2040311, 2040315, 2040319, 2040403, 2040407, 2040411, 2040415, 2040419, 2040503, 2040507, 2040511, 2040515, 2040519, 2040603, 2040607, 2040611, 2040615, 2040619, 2040703, 2040707, 2040711, 2040715, 2040719, 2040731, 2040823, 2040923, 2041003, 2041007, 2041011, 2041015, 2041019, 2041103, 2041107, 2041111, 2041115, 2041119, 2041203, 2041207, 2041211, 2041215, 2041219, 2041303, 2041307, 2041311, 2041315, 2041319, 2048003, 2048007, 2048011, 2048015, 2048019, 2048031, 2043023, 2043123, 2043223, 2043323, 2043727, 2043827, 2044023, 2044123, 2044223, 2044323, 2044423, 2044523, 2044623, 2044723, 2044823, 2044923);
var _60卷轴 = Array(2040001, 2040005, 2040009, 2040013, 2040017, 2040101, 2040105, 2040109, 2040113, 2040117, 2040201, 2040205, 2040209, 2040213, 2040217, 2040301, 2040305, 2040309, 2040313, 2040317, 2040401, 2040405, 2040409, 2040413, 2040417, 2040501, 2040505, 2040509, 2040513, 2040517, 2040601, 2040605, 2040609, 2040613, 2040617, 2040701, 2040705, 2040709, 2040713, 2040717, 2040729, 2040821, 2040921, 2041001, 2041005, 2041009, 2041013, 2041017, 2041101, 2041105, 2041109, 2041113, 2041117, 2041201, 2041205, 2041209, 2041213, 2041217, 2041301, 2041305, 2041309, 2041313, 2041317, 2048001, 2048005, 2048009, 2048013, 2048017, 2048029, 2043021, 2043121, 2043221, 2043321, 2043725, 2043825, 2044021, 2044121, 2044221, 2044321, 2044421, 2044521, 2044621, 2044721, 2044821, 2044921, 2049001, 2049101);
var _10卷轴 = Array(2040002, 2040006, 2040010, 2040014, 2040018, 2040102, 2040106, 2040110, 2040114, 2040118, 2040202, 2040206, 2040210, 2040214, 2040218, 2040302, 2040306, 2040310, 2040314, 2040318, 2040402, 2040406, 2040410, 2040414, 2040418, 2040502, 2040506, 2040510, 2040514, 2040518, 2040602, 2040606, 2040610, 2040614, 2040618, 2040702, 2040706, 2040710, 2040714, 2040718, 2040730, 2040822, 2040922, 2041002, 2041006, 2041010, 2041014, 2041018, 2041102, 2041106, 2041110, 2041114, 2041118, 2041202, 2041206, 2041210, 2041214, 2041218, 2041302, 2041306, 2041310, 2041314, 2041318, 2048002, 2048006, 2048010, 2048014, 2048018, 2048030, 2043022, 2043122, 2043222, 2043322, 2043726, 2043826, 2044022, 2044122, 2044222, 2044322, 2044422, 2044522, 2044622, 2044722, 2044822, 2044922, 2049002);
var 技能书 = Array(2280000, 2280001, 2280002, 2280003, 2280004, 2280005, 2280006, 2280007, 2280008, 2280009, 2280010, 2280011, 2280012, 2280013, 2280014, 2280015, 2280016);
var _20能手册 = Array(2290000, 2290002, 2290004, 2290006, 2290008, 2290010, 2290012, 2290014, 2290016, 2290018, 2290019, 2290020, 2290022, 2290024, 2290026, 2290028, 2290030, 2290032, 2290034, 2290036, 2290038, 2290042, 2290044, 2290046, 2290048, 2290050, 2290052, 2290054, 2290056, 2290058, 2290060, 2290062, 2290064, 2290066, 2290068, 2290070, 2290072, 2290074, 2290076, 2290078, 2290080, 2290082, 2290084, 2290086, 2290088, 2290090, 2290092, 2290094, 2290096, 2290040, 2290097, 2290099, 2290101, 2290102, 2290104, 2290106, 2290108, 2290110, 2290112, 2290114, 2290115, 2290117, 2290119, 2290121, 2290123, 2290124, 2290126, 2290128, 2290130, 2290132, 2290134, 2290136, 2290138);
var _30能手册 = Array(2290001, 2290003, 2290005, 2290007, 2290009, 2290011, 2290013, 2290015, 2290017, 2290021, 2290023, 2290025, 2290027, 2290029, 2290031, 2290033, 2290035, 2290037, 2290039, 2290043, 2290045, 2290047, 2290049, 2290051, 2290053, 2290055, 2290057, 2290059, 2290061, 2290063, 2290065, 2290067, 2290069, 2290071, 2290073, 2290075, 2290077, 2290079, 2290081, 2290083, 2290085, 2290087, 2290089, 2290091, 2290093, 2290095, 2290041, 2290098, 2290100, 2290103, 2290105, 2290107, 2290111, 2290113, 2290116, 2290118, 2290120, 2290122, 2290125, 2290127, 2290129, 2290131, 2290133, 2290135, 2290137, 2290139);
var 卷轴碎片 = 3995999;
var 书籍碎片 = Array(3995001, 3995002, 3995003, 3995004, 3995005, 3995006, 3995007);

var toMake;
var needs;
var fee1;
var fee2;

function action(mode, type, selection) {
	status++;
	if(mode != 1) {
		if(mode == 0 && type != 4) {
			status -= 2;
		} else {
			cm.dispose();
			return;
		}
	}
	if(status == 0) {
		var text = "这里是卷轴/技能书碎片兑换,需要做些什么?\r\n"
		text += "#L0#卷轴分解#l\r\n";
		text += "#L1#技能书分解#l\r\n";
		text += "#L2#合成卷轴#l\r\n";
		text += "#L3#合成技能书#l\r\n";
		cm.sendSimple(text);
	} else if(status == 1) {
		sel1 = selection;
		if(sel1 == 0) {
			var inv = cm.getInventory(2);
			var text = "\t\t\t  #e- 请选择要分解的卷轴 -#n\r\n\r\n#b";
			var aaa = false;
			for(var i = 1; i <= inv.getSlotLimit(); i++) {
				var it = inv.getItem(i);
				if(it == null) {
					continue;
				}
				var itemid = it.getItemId();
				if(itemid >= 2040000 && itemid < 2050000&&(itemid%4!=0)) { //排除商店购买的卷轴
					aaa = true;
					text += "#L" + itemid + "##z" + itemid + "##l\r\n";
				}
			}
			if(aaa) {
				cm.sendSimple(text);
			} else {
				cm.sendOk("没有可以分解的卷轴,商店购买的卷轴不支持分解");
				cm.dispose();
			}
		} else if(sel1 == 1) {
			var inv = cm.getInventory(2);
			var text = "\t\t\t  #e- 请选择要分解的技能书 -#n\r\n\r\n#b";
			var aaa = false;
			for(var i = 1; i <= inv.getSlotLimit(); i++) {
				var it = inv.getItem(i);
				if(it == null) {
					continue;
				}
				var itemid = it.getItemId();
				if(itemid >= 2280000 && itemid < 2300000) { //排除商店购买的卷轴
					aaa = true;
					text += "#L" + itemid + "##v" + itemid + "##l";
				}
			}
			if(aaa) {
				cm.sendSimple(text);
			} else {
				cm.sendOk("没有可以分解的技能书");
				cm.dispose();
			}
		} else if(sel1 == 2) {
			var text = "\t\t\t  #e- 请选择要合成的卷轴类型 -#n\r\n\r\n#b"
			text += "#L0#必成卷轴(需要1000卷轴碎片+1亿金币)#l\r\n"
			text += "#L1#10%卷轴(需要100卷轴碎片+1千万金币)#l\r\n"
			text += "#L2#60%卷轴(需要100卷轴碎片+1千万金币)#l\r\n"
			cm.sendSimple(text);
		} else if(sel1 == 3) {
			var text = "\t\t\t  #e- 请选择要合成的技能书类型 -#n\r\n\r\n#b"
			text += "#L3#技能书(需要5套书籍碎片+1千万金币)#l\r\n"
			text += "#L4#20级能手册(需要10套书籍碎片+3千万金币)#l\r\n"
			text += "#L5#30级能手册(需要20套书籍碎片+8千万金币)#l\r\n"
			cm.sendSimple(text);
		}
	} else if(status == 2) {
		sel2 = selection;
		if(sel1 == 0) { //分解卷轴
			var count = cm.getPlayer().getItemQuantity(selection, false);
			count = count * Math.floor(3 + Math.random() * 8); //一个卷轴分解出3-10个卷轴碎片
			cm.gainItem(selection, -cm.getPlayer().getItemQuantity(selection, false));
			cm.gainItem(卷轴碎片, count);
			status = 0;
			action(1, 0, 0);
		} else if(sel1 == 1) { //分解技能书
			var count = cm.getPlayer().getItemQuantity(selection, false);
			var changes = new Array(new Array(书籍碎片[0], 0), new Array(书籍碎片[1], 0), new Array(书籍碎片[2], 0), new Array(书籍碎片[3], 0), new Array(书籍碎片[4], 0), new Array(书籍碎片[5], 0), new Array(书籍碎片[6], 0), new Array(书籍碎片[7], 0));
				cm.gainItem(selection, -count);
			for(var i = 0; i < count; i++) {
				var index = Math.floor(Math.random() * 书籍碎片.length);
				changes[index][1] += 1;
			}
			for(var i = 0; i < changes.length; i++) {
				if(changes[i][1] > 0)
					cm.gainItem(changes[i][0], changes[i][1]);
			}
			status = 0;
			action(1, 0, 1);
		} else {
			if(sel2 == 0) {
				toMake = 必成卷轴;
				needs = 卷轴碎片;
				fee1 = 100000000;
				fee2 = 1000;
			} else if(sel2 == 1) {
				toMake = _10卷轴;
				needs = 卷轴碎片;
				fee1 = 10000000;
				fee2 = 100;
			} else if(sel2 == 2) {
				toMake = _60卷轴;
				needs = 卷轴碎片;
				fee1 = 10000000;
				fee2 = 100;
			} else if(sel2 == 3) {
				toMake = 技能书;
				needs = 书籍碎片;
				fee1 = 10000000;
				fee2 = 5;
			} else if(sel2 == 4) {
				toMake = _20能手册;
				needs = 书籍碎片;
				fee1 = 30000000;
				fee2 = 10;
			} else if(sel2 == 5) {
				toMake = _30能手册;
				needs = 书籍碎片;
				fee1 = 80000000;
				fee2 = 20;
			}
			var text = "\t\t\t选择要合成的道具\t\t\t#b\r\n";
			for(var i = 0; i < toMake.length; i++) {
				text += "#L" + toMake[i] + "##z" + toMake[i] + "##l";
				if(i % 2 == 1)
					text += "\r\n";
			}
			cm.sendSimple(text);
		}
	} else if(status == 3) {
		var item = selection;
		if(item < 2050000) { //制作卷轴
			if(cm.hasItem(needs, fee2) && cm.getPlayer().getMeso() >= fee1) {
				cm.gainItem(needs, -fee2);
				cm.gainMeso(-fee1);
				cm.gainItem(item);
				cm.dispose();
			} else {
				cm.sendOk("道具或金币不足");
				cm.dispose();
			}
		} else {
			if(cm.getPlayer().getMeso() >= fee1) {
				for(var i = 0; i < needs.length; i++) {
					if(!cm.hasItem(needs[i], fee2)) {
						cm.sendOk("#z" + needs[i] + "#的数量不足");
						cm.dispose();
						return;
					}
				}
				for(var i = 0; i < needs.length; i++) {
					cm.gainItem(needs[i], -fee2);
				}
				cm.gainMeso(-fee1);
				cm.gainItem(item);
				cm.sendOk("成功合成了一本#z" + item + "#");
				cm.dispose();
			} else {
				cm.sendOk("金币不足");
				cm.dispose();
			}
		}
	}
}